package by.jonline.mod01.branching.main;
// Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2- вывести на экран цифру 7, в противном случае — цифру 8.

public class Task01 {

	public static void main(String[] args) {
		
		double num1 = 1.0;
		double num2 = 10.0;
		
		if (num1 < num2) {
			System.out.println(7);
		} else {
			System.out.println(8);
		}
		
		

	}

}
