package by.jonline.mod01.branching.main;
// Составить программу сравнения введенного числа а и цифры 3. Вывести на экран слово «yes», если число а меньше 3; если больше, то вывести слово «nо».

public class Task03 {

	public static void main(String[] args) {
		double a = 7.0;
		double num = 3.0;
		
		if (a < num) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}

	}

}