package by.jonline.mod01.branching.main;
// Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае - слово «nо»

public class Task2 {

	public static void main(String[] args) {
		double num1 = 15.0;
		double num2 = 10.5;
		
		if (num1 < num2) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}
		

	}

}
