package by.jonline.mod01.linear.main;
//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника.

public class Task05 {
	
	public static void main(String[] args) {
		
		double l = 12.0;
		double w = l / 2.0;
		
		double square = w * l;
		
		System.out.println(square);
		
	}

}
