package by.jonline.mod01.cycle.main;
// С помощью оператора whіlе напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.

public class Task4 {

	public static void main(String[] args) {
		int i = 2;
		while(i < 101) {
			System.out.println(i);
			i += 2;
		}
		

	}

}
